---
kind: other
id: Methods.T:Autodesk.Revit.DB.TypeBinding
source: html/08a12fdb-762d-7477-aa3e-d000b16f818c.htm
---
# TypeBinding Methods

Causes the object to release immediately any resources it may be utilizing.